/// 마이 아이템 아이템 페이지 JS - item.js

/// 객체로 아이템 정보 셋팅하기 ///
let itfo = {
    "스마트폰": {
        "아이템명": "아이폰6 플러스",
        "아이콘": "ico1",
        "이미지": "images/iphone6.png",
        "설명": "iPhone 6s 및 iPhone 6s Plus는 32GB 또는 128GB 저장 용량으로 구입할 수 있습니다. \"GB\"는 기가바이트를 의미하며, 기가바이트가 클수록 앱, 게임, 사진, HD 동영상, 음악, 영화 등을 비롯한 다양한 콘텐츠를 더 많이 저장할 수 있습니다. 저장해야 할 사진이나 음악이 많거나 앱을 많이 다운로드하는 경우에는 용량이 큰 iPhone을 구입하는 것이 좋습니다. 반대로 앱을 많이 다운로드하지 않거나 사진 또는 동영상을 촬영하지 않는다면 용량이 작은 iPhone이 적당할 수 있습니다." // 쌍따옴표 안에 쌍따옴표는 역슬래쉬로 처리함!
    },
    "태블릿PC": {
        "아이템명": "아이패드",
        "아이콘": "ico2",
        "이미지": "images/ipad2.png",
        "설명": "아이패드 1세대에 비해 두께가 13.4 mm에서 8.8 mm로 더 얇아지고, 중량도 Wi-Fi 모델 기준으로 680 g에서 600 g으로 많이 가벼워졌으며, 3G 모델의 경우 중량 차이가 훨씬 더 크다. 기본 연산 속도 및 배터리 성능도 강화되었고 디스플레이 해상도는 그대로지만 더 밝아졌다. 특히 카메라의 부재가 아쉬움을 샀던 1세대에 비해 HD급 캠코더 기능을 지원하는 후면 카메라도 탑재되었다."
    },
    "노트북": {
        "아이템명": "맥북에어",
        "아이콘": "ico3",
        "이미지": "images/macbook.png",
        "설명": "스티브 잡스가 2008년 1월 열린 애플 키노트에서 서류봉투에서 꺼내면서 처음으로 공개되었다. 자칭 '세계에서 가장 얇은 노트북'[2] 맥북에어보다 얇고 가벼운 노트북들이 널린 2016년도에도 얇은 노트북하면 맥북에어를 떠올릴 정도로 얇은 노트북의 대명사라고 할 수 있다.1~3세대까지는 비싸고 확장성이 떨어진다는 것이 가장 큰 단점으로 지적되었다. 맥북 에어 발표 당시 키노트에 뜬 $1799를 아직도 기억하는 사람들이 많을 것이다."
    },
    "가방": {
        "아이템명": "가방",
        "아이콘": "ico4",
        "이미지": "images/bag.png",
        "설명": "여성과 남성 의류, 핸드백, 지갑, 생횔용품, 신발, 보석, 시계, 선글라스, 향수와 화장품, 아동 의류를 만드는 이탈리아의 명품 브랜드이다. 루이비통에 밀린 콩라인. 남성 가방도 구찌가 짱이다!!!!!"
    },
    "시계": {
        "아이템명": "시계",
        "아이콘": "ico5",
        "이미지": "images/watch.png",
        "설명": "시계 매니아들 사이에서의 평가는 롤렉스미만잡으로 치는 상위의 매니아 사이에서는 낮은 등급의 시계 취급을 받지만 보통의 매니아들은 한번씩은 다들 거쳐가거나 주력으로 사용하는 사람도 많다. 사면 다들 이쁘다고 하지 왜샀느냐고 하지는 않는다. 사면 호구라고 호구호이어라는 말도 있지만 사실 온라인에서 호구소리 안듣는 브랜드도 없고 막상 200~300만원대 시계 추천을 구할경우 결국 추천받는건 태그호이어 몰표이다."
    },
    "구두": {
        "아이템명": "구두",
        "아이콘": "ico6",
        "이미지": "images/shoes.png",
        "설명": "기원은 유럽 쪽이나, 현대적 구두의 등장 기원은 불분명하다.[3] 다만 가죽을 주 재료로 만드는 신발이기 때문에 역사가 오래 되었을 가능성이 높다. 한반도에 구두가 처음 전파된 계기는 1880년대 경으로, 외국에 다녀온 사람들이 구두를 신고 들어온 것이 그 시초로 여겨진다. '구두'라는 말의 어원은 분명치 않으며(아래서술 참고), 1900년도에 한반도에도 구두 생산 공장이 들어서면서 본격적으로 구두 공급이 시작되었다."
    }
}; ///// itfo 객체 ///////////////////////////////

// Get방식으로 넘어온 값 받기! //////////////////////
let pm = location.href;
// console.log(pm);
// location.href 의 두얼굴~~~
// 1. 이퀄 왼쪽에 쓰면 오른쪽 url값으로 페이지 이동
// 2. 이퀄 오른쪽에 쓰면 브라우저 url값을 가져옴!

/// url가공전에 물음표가 있는지 확인하여 없으면 돌려보낸다!
// indexOf(문자열) -> 찾는 문자열의 순번을 리턴함!
// 만약 찾는 문자열이 없으면 -1을 리턴함!!!
// // console.log("문자열찾기:"+pm.indexOf("?"));
if (pm.indexOf("?") === -1) {
    // alert("비정상적인 접근입니다!");
    location.href = "index.html"; //첫페이지로 돌아가!
} ///////////////////// if //////////////////////////

// url 문자값 가공처리하기 //

// 1. ?(물음표)로 잘라 뒤엣것 저장하기(참고:JS007.html)
pm = pm.split("?")[1];
// 물음표로 자르면 배열에 물음표 앞뒤로 담기고
// 그 중 뒤엣것 즉 [1]이 전달값이다!
// console.log(pm);

// 2. =(이퀄)로 잘라 뒤엣것 저장하기
pm = pm.split("=")[1];

// 3. escape변환문자 복원하기(unescape)
pm = unescape(pm);
// console.log(pm);

///////////// 로드구역 //////////////////
$(function () { //// jQB ///////////////////

    // console.log("아이템JS로드!");

    // Get 방식으로 받은 pm변수의 값은 
    // 아이템 객체변수 itfo의 속성명과 같다!!!
    // 따라서 itfo[pm]으로 해당속성값을 가져와 
    // 페이지 각 요소에 정보를 셋팅한다!!!

    // "디바이스"는 "스마트폰"으로
    // "패션"은 "가방"으로 매칭한다!
    if (pm === "디바이스") pm = "스마트폰";
    else if (pm === "패션") pm = "가방";

    // 아이템 정보를 변수에 할당!
    let ifo = itfo[pm];

    // 제목요소
    let stit = $(".stit");

    // 이미지박스요소
    let imbx = $(".imbx");

    // 설명박스요소
    let dcbx = $(".dcbx");

    // 아이템 정보는 객체이므로 for in문을 사용함!
    for (let x in ifo) {

        // console.log("속성명:" + x);
        // console.log("속성값:" + ifo[x]);

        // 속성명에 해당하는 작업을 분기함!
        switch (x) {
            case "아이템명":
                stit.text(ifo[x]);
                break;
            case "아이콘":
                stit.addClass(ifo[x]);
                break;
            case "이미지":
                imbx.html('<img src="' + ifo[x] + '" alt="아이템이미지">');
                break;
            case "설명":
                dcbx.text(ifo[x]);
                break;

        } ////////// switch case문 ////////////

        // "태블릿PC" 일때 이미지 가로크기 조정!
        if (pm === "태블릿PC") {
            imbx.find("img").css({
                width: "70%"
            });
        } ///////// if ///////////////////////

        ///////// 등장액션 //////////
        // 메뉴 순서상 홀수는 이미지 왼쪽, 설명 오른쪽
        // 짝수는 이미지 오른쪽, 설명 왼쪽

        // 이미지 left값
        let ileft = "0";

        // 설명 left값
        let dleft = "50%";

        // 위의 기본 left값을 반대로 보낸것만 if문으로 정의!
        if (pm === "태블릿PC" ||
            pm === "가방" ||
            pm === "구두") {
                // 이미지 left값
                ileft = "55%";
                // 설명 left값
                dleft = "0";
        } ///////////////// if //////////////

        // 이미지박스 등장 //
        imbx.animate({
            left: ileft,
            opacity: 1
        }, 1000, "easeInOutQuint");

        // 설명박스 등장 ///
        dcbx.animate({
            left: dleft,
            opacity: 1
        }, 1000, "easeInOutQuint");



    } ///////// for in문 ////////////////



}); ////////////// jQB ///////////////////