// 로그인 페이지 JS - login.js

$(function () { ////////// jQB /////////////////////////

    //// 로그인 버튼 클릭시 유효성 검사하기 //////////////
    /// 유효성 검사내용: 아이디와 비번이 비어있지 않아야함!
    // 대상: #sbtn
    $("#sbtn").click(function (e) {

        // 기본 서브밋 이동막기!
        e.preventDefault();
        console.log("로그인검사!");

        // 모든공백제거함수 //////////////////////
        let groSpace = val => {
            let newval = val.replace(/\s/g, "");
            return newval;
        }; //////////// groSpace함수 ////////////

        // 아이디, 비번 모든공백 제거후 변수에 담기
        let mid = groSpace($("#mid").val());
        let mpw = groSpace($("#mpw").val());

        // 공백제거된 값을 다시 원래입력폼에 넣기
        $("#mid").val(mid);
        $("#mpw").val(mpw);


        // 아이디와 비번 모두 비어있는지 검사!
        if (mid === "" || mpw === "") {
            alert("아이디와 비밀번호를 모두 입력해야합니다!");
        } //////////// if ////////////////////////////////
        else {
            alert("로그인에 성공하였습니다!");
        } //////////// else /////////////////////////////


    }); ////////////// click ///////////////////

}); //////////////////// jQB /////////////////////////